app/views/profiles/edit.html.erb

  <p class ="cover-name">
    <%= @profile.user.first_name %> <%= @profile.user.last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]