app/views/profiles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <p class ="cover-name">
    <%= @profile.user.first_name %> <%= @profile.user.last_name %>

SELECT  1 AS one FROM "users" INNER JOIN "requests" ON "users"."id" = "requests"."requestee_id" WHERE "requests"."requester_id" = $1 AND "users"."id" = $2 LIMIT $3  [["requester_id", 5], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "requests" ON "users"."id" = "requests"."requester_id" WHERE "requests"."requestee_id" = $1 AND (requests.accepted = 0)  [["requestee_id", 2]]
SELECT  1 AS one FROM "users" INNER JOIN "requests" ON "users"."id" = "requests"."requester_id" WHERE "requests"."requestee_id" = $1 AND "users"."id" = $2 LIMIT $3  [["requestee_id", 2], ["id", 1], ["LIMIT", 1]]
---
  <% unless current_user == @profile.user %>
    <% if current_user.requesters.where('requests.accepted = ?', 0).include?(@profile.user) %>
      <%= link_to "Accept Friend Request", request_path(id: current_user.received_requests.find_by(requester_id: @profile.user.id).id, request: { requester_id: @profile.user.id }), method: :put, class: "add-friend-button" %>
    <% elsif current_user.requesters.include?(@profile.user) %>
    <% elsif !current_user.requestees.include?(@profile.user) %>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

            <%= link_to "#{post.user.first_name}", post.user.profile, class: "user-name" %>

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND (user_id = 1) ORDER BY "likes"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
---
        <div class="like-comment-buttons">
          <% like = post.likes.where("user_id = ?", current_user.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---

        <% if post.likes.count > 0 %>

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 ORDER BY "likes"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
            <%= fa_icon('thumbs-up', type: :solid, style: 'color:RGB(35,153,85)') %>
            <% case post.likes.count %>
            <% when 1 %>
                <% user = User.find(post.likes.first.user_id) %>
                <strong>
                  <%= link_to "#{user.first_name} #{user.last_name}", user.profile, class: "user-name" %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

        <% if post.comments.count > 0 %>
        <div class="all-comments">
          <% post.comments.each do |comment| %>
            <% user = User.find(comment.user_id) %>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
              <span class="comment-content">
                <strong><%= link_to "#{user.first_name} #{user.last_name}", user.profile, class: "user-name" %></strong> <%= comment.content %>