app/channels/room_channel.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def subscribed
      room = Room.find params[:room]