app/views/rooms/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 5], ["id", 1]]
---
              <%= image_tag room_message.user.profile.profile_photo('tac'), class: 'tac-image' %>
               <%= room_message.user.first_name %>

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "1_2"], ["created_at", "2020-01-15 10:32:39.802338"], ["updated_at", "2020-01-15 10:32:39.802338"]]
---
                  <small>
                    <%= room_message.created_at.month.to_s<<"-"<<room_message.created_at.day.to_s<<"   "<<room_message.created_at.hour.to_s<<":"<<room_message.created_at.min.to_s%>

SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "public_room"], ["LIMIT", 1]]
---
<script>
$(function() {
    $('#new_room_message').on('ajax:success', function(a, b,c ) {
      $(this).find('input[type="text"]').val('');
      document.getElementById("room_message_message").value="";
    });
  });

$(function() {
    $('[data-channel-subscribe="room"]').each(function(index, element) {
      var $element = $(element),
          room_id = $element.data('room-id')
          messageTemplate = $('[data-role="message-template"]');

      $element.animate({ scrollTop: $element.prop("scrollHeight")}, 1000)

      App.cable.subscriptions.create(
        {
          channel: "RoomChannel",
          room: room_id
        },
        {
          received: function(data) {
            var content = messageTemplate.children().clone(true, true);
            content.find('[data-role="user-avatar"]').attr('src', data.user_avatar_url);
            content.find('[data-role="message-text"]').text(data.message);
            console.log(data);
            content.find('[data-role="user-name"]').text(data.user_full_name);
            content.find('[data-role="message-date"]').text(data.updated_at.slice(5,10)+" "+data.updated_at.slice(11,16));