app/views/posts/index.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---

        <%= link_to "#{post.user.first_name}", post.user.profile, class: "user-name" %>

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND (user_id = 1) ORDER BY "likes"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
---
    <div class="like-comment-buttons">
      <% like = post.likes.where("user_id = ?", current_user.id) %>

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND (user_id = 1) ORDER BY "likes"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
---
      <% else %>
        <%= button_to like.first, method: :delete, class: "like-button unlike" do %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]
---

    <% if post.likes.count > 0 %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 ORDER BY "likes"."created_at" DESC LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
        <%= fa_icon('thumbs-up', type: :solid, style: 'color:RGB(35,153,85)') %>
        <% case post.likes.count %>
        <% when 1 %>
            <% user = User.find(post.likes.first.user_id) %>
            <strong>
              <%= link_to "#{user.first_name} #{user.last_name}", user.profile, class: "user-name" %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

    <% if post.comments.count > 0 %>
    <div class="all-comments">
      <% post.comments.each do |comment| %>
        <% user = User.find(comment.user_id) %>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
          <span class="comment-content">
            <strong><%= link_to "#{user.first_name} #{user.last_name}", user.profile, class: "user-name" %></strong> <%= comment.content %>