app/controllers/rooms_controller.rb

    def index
        @room = Room.find_by(name:"public_room")
        @room_message = RoomMessage.new room: @room
        @room_messages = @room.room_messages.includes(:user)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "public_room"], ["LIMIT", 1]]
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 1]]
SELECT "users".* FROM "users"

    def create
        @myroom = Room.new
        @myroom.name = "public_room"
        @myroom.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "public_room"], ["created_at", "2020-01-15 10:09:38.278305"], ["updated_at", "2020-01-15 10:09:38.278305"]]

    def show
        id1 = params[:chat]["user2_id"].to_i
        id2 = current_user.id
        if id1<=id2
            room_name = id1.to_s + '_' + id2.to_s
        else
            room_name = id2.to_s + '_' + id1.to_s
        end
        @room = Room.find_by(name:room_name)
        if(@room == nil)
            flag = true
            @room = Room.new
            @room.name = room_name
            @room.save
        end
        @room_message = RoomMessage.new room: @room
        @room_messages = @room.room_messages.includes(:user)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "1_2"], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "1_2"], ["created_at", "2020-01-15 10:32:39.802338"], ["updated_at", "2020-01-15 10:32:39.802338"]]
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 5], ["id", 1]]

    def one
        name_root = params[:format].to_s
        @room = Room.find_by(name:name_root)
        @room_message = RoomMessage.new room: @room
        @room_messages = @room.room_messages.includes(:user)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "1_5"], ["LIMIT", 1]]
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 5], ["id", 1]]