app/controllers/room_messages_controller.rb

INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["room_id", 5], ["user_id", 1], ["message", "nengyongma"], ["created_at", "2020-01-15 10:32:47.658473"], ["updated_at", "2020-01-15 10:32:47.658473"]]
---
    def create
        @room_message = RoomMessage.create user: current_user,
                                           room: @room,
                                           message: params.dig(:room_message, :message)

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def load_entities
        @room = Room.find params.dig(:room_message, :room_id)