app/models/user.rb

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2020-01-15 09:50:55.822244"], ["updated_at", "2020-01-15 09:50:55.822244"]]
---
  def make_profile
    # This is for login with facebook or github
    self.create_profile.save