app/views/layouts/application.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
            <li class="link-user-name">
              <%= link_to "#{current_user.first_name}", current_user.profile %>

SELECT "users".* FROM "users"
---

            <% User.all.each do |user| %>

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "3_5"], ["LIMIT", 1]]
---
                <% name_root = user.id.to_s + '_' + current_user.id.to_s%>
                <% if (Room.find_by(name:name_root) != nil) %>

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 LIMIT $2  [["name", "1_3"], ["LIMIT", 1]]
---
                <% name_root = current_user.id.to_s + '_' + user.id.to_s%>
                <% if (Room.find_by(name:name_root) != nil) %>